#!/usr/bin/env python
# -*- coding: utf-8 -*-

description = {
	"B1"	:	{ 
	"name"	:	"марки автобусов", 
	"prop"	:	{
	"1"		:	"марка автобуса",
	"2"		:	"тип автобуса",
	"5"		:	"кол-во мест сидения",
	"6"		:	"кол-во мест стояния",
	"153"	:	"салон 0",
	"154"	:	"салон 1"
	}
	},
	"B4": { 
	"name"	:	"шаблон резервирования", 
	"prop"	:	{
	"3"		:	"код шаблона резервирования",
	"7"		:	"с места",
	"8"		:	"по место",
	"9"		:	"код ор от",
	"10"	:	"код оп до",
	"12"	:	"вид билета",
	"19"	:	"автор",		
	"70"	:	"поля билета"
	}
	},
	"B9": { 
	"name"	:	"заголовки рейсов", 
	"prop"	:	{
	"1"		:	"марка автобуса",
	"2"		:	"тип автобуса",	
	"3"		:	"код шаблона резервирования",
	"5"		:	"кол-во мест сидения",
	"6"		:	"кол-во мест стояния",
	"22"	:	"номер рейса",
	"23"	:	"периодичность",
	"24"	:	"тип рейса",
	"26"	:	"код ор",	
	"27"	:	"время прибытия",
	"28"	:	"время отправления",
	"67"	:	"код ор б",
	"68"	:	"код ор а"
	}
	},
	"B11": { 
	"name"	:	"рейсы время маршруты", 
	"prop"	:	{
	"22"	:	"номер рейса",
	"26"	:	"код ор",
	"27"	:	"время прибытия",
	"28"	:	"время отправления",
	"29"	:	"код ор след"
	}
	},
	"B12": { 
	"name"	:	"расстояния", 
	"prop"	:	{
	"32"	:	"расстояние",
	"67"	:	"код ор б",
	"68"	:	"код ор а"
	}
	},
	"B13": { 
	"name"	:	"организации", 
	"prop"	:	{
	"19"	:	"автор",
	"26"	:	"код организации",
	"33"	:	"группа ор",
	"34"	:	"наименование организации",
	"35"	:	"атрибуты организации",
	"122"	:	"примечания",
	"134"	:	"аналитика",		
	"135"	:	"р/счет",	
	"136"	:	"мфо"
	}
	},
	"B14": { 
	"name"	:	"заголовки ведомостей", 
	"prop"	:	{
	"1"		:	"марка автобуса",
	"2"		:	"тип автобуса",
	"5"		:	"кол-во мест сидения",
	"6"		:	"кол-во мест стояния",
	"22"	:	"номер рейса",
	"24"	:	"тип рейса",
	"36"	:	"дата",
	"37"	:	"номер ведомости",
	"69"	:	"статус ведомости",
	"100"	:	"транзит",			
	"120"	:	"маршрут",				
	"121"	:	"nдата"
	}
	},
	"B15": { 
	"name"	:	"ведомость места", 
	"prop"	:	{
	"9"		:	"код организации от",
	"10"	:	"код организации до",
	"12"	:	"вид билета",
	"21"	:	"номер билета",
	"37"	:	"номер ведомости",
	"38"	:	"номер места",
	"70"	:	"поля билета",		
	"107"	:	"внешний номер",
	"108"	:	"поля сдн",		
	"134"	:	"аналитика"
	}
	},
	"B18": { 
	"name"	:	"должностные лица", 
	"prop"	:	{
	"34"	:	"наименование организации",
	"43"	:	"табельный номер",
	"46"	:	"ФИО",
	"65"	:	"отчет",
	"88"	:	"отзыв жетона / пароль",
	"89"	:	"список кодов доступа",
	"94"	:	"протокол",		
	"98"	:	"модуль",
	"109"	:	"код АС",
	"134"	:	"аналитика",
	"147"	:	"должность",
	"148"	:	"аналитика-1",	
	"149"	:	"аналитика-2"
	}
	},
	"B19": { 
	"name"	:	"диспетчерский журнал", 
	"prop"	:	{
	"1"		:	"марка автобуса",
	"2"		:	"тип автобуса",
	"5"		:	"кол-во мест сидения",
	"6"		:	"кол-во мест стояния",
	"22"	:	"номер рейса",
	"24"	:	"тип рейса",
	"26"	:	"код организации",
	"28"	:	"время отправления",		
	"36"	:	"дата",
	"46"	:	"ФИО",
	"47"	:	"госномер автобуса",
	"48"	:	"n бул",
	"70"	:	"поля билета",
	"71"	:	"фактическое время прибытия",
	"72"	:	"фактическое время отправления",
	"73"	:	"нарушения",
	"109"	:	"код АС",
	"120"	:	"маршрут",
	"121"	:	"nдата",		
	"143"	:	"nперенос"
	}
	},
	"B27": { 
	"name"	:	"замены", 
	"prop"	:	{
	"1"		:	"марка автобуса",
	"2"		:	"тип автобуса",
	"5"		:	"кол-во мест сидения",
	"6"		:	"кол-во мест стояния",
	"37"	:	"номер ведомости",
	"74"	:	"список ведомостей замены"
	}
	},
	"B28": { 
	"name"	:	"виды нарушений", 
	"prop"	:	{
	"75"	:	"код нарушения",
	"76"	:	"наименование нарушения",
	"122"	:	"примечания"
	}
	},
	"B33": { 
	"name"	:	"отчеты по ведомостям", 
	"prop"	:	{
	"19"	:	"автор",
	"22"	:	"номер рейса",
	"24"	:	"тип рейса",
	"28"	:	"время отправления",
	"36"	:	"дата",
	"37"	:	"номер ведомости",
	"69"	:	"статус ведомости",
	"70"	:	"поля билета",
	"107"	:	"внешний номер",
	"109"	:	"код АС",
	"110"	:	"код АТП",
	"120"	:	"маршрут",
	"121"	:	"nдата",
	"122"	:	"примечания",
	"126"	:	"статистика",
	"143"	:	"nперенос",
	"144"	:	"статистика льготных",
	"145"	:	"статистика бесплатных",		
	"146"	:	"статистика маршрут"
	}
	},
	"B34": { 
	"name"	:	"отчеты", 
	"prop"	:	{
	"36"	:	"дата",
	"43"	:	"табельный номер",
	"65"	:	"отчет",
	"86"	:	"номер документа",
	"101"	:	"владелец",
	"109"	:	"код АС",
	"121"	:	"nдата",
	"122"	:	"примечания",
	"134"	:	"аналитика",
	"143"	:	"nперенос",
	"148"	:	"аналитика-1",		
	"149"	:	"аналитика-2"
	}
	},
	"B35": { 
	"name"	:	"утреб?", 
	"prop"	:	{
	"9"		:	"код организации от",
	"10"	:	"код организации до",
	"19"	:	"автор",
	"21"	:	"номер билета",
	"32"	:	"расстояние",
	"36"	:	"дата",
	"37"	:	"номер ведомости",
	"70"	:	"поля билета",
	"108"	:	"поля сдн",
	"109"	:	"код АС",
	"121"	:	"nдата",
	"122"	:	"примечания",
	"123"	:	"серия в/т",
	"124"	:	"номер в/т",
	"125"	:	"код в/т",		
	"143"	:	"nперенос"
	}
	},
	"B36": { 
	"name"	:	"", 
	"prop"	:	{
	"9"		:	"код организации от",
	"10"	:	"код организации до",
	"19"	:	"автор",
	"22"	:	"номер рейса",
	"36"	:	"дата",
	"37"	:	"номер ведомости",
	"70"	:	"поля билета",
	"107"	:	"внешний номер",
	"109"	:	"код АС",
	"110"	:	"код АТП",
	"121"	:	"nдата",
	"122"	:	"примечания",
	"134"	:	"аналитика",		
	"143"	:	"nперенос"
	}
	},
	"B37": { 
	"name"	:	"переходящие суммы", 
	"prop"	:	{
	"19"	:	"автор",
	"21"	:	"номер билета",
	"22"	:	"номер рейса",
	"24"	:	"тип рейса",
	"36"	:	"дата",
	"37"	:	"номер ведомости",
	"70"	:	"поля билета",
	"109"	:	"код АС",
	"121"	:	"nдата",
	"122"	:	"примечания",
	"127"	:	"на дату",
	"131"	:	"дата по",
	"133"	:	"nдата по",		
	"143"	:	"nперенос"
	}
	},
	"B38": { 
	"name"	:	"невостребованные суммы", 
	"prop"	:	{
	"19"	:	"автор",
	"22"	:	"номер рейса",
	"24"	:	"тип рейса",
	"36"	:	"дата",
	"37"	:	"номер ведомости",
	"70"	:	"поля билета",
	"101"	:	"владелец",
	"109"	:	"код АС",
	"110"	:	"код АТП",
	"121"	:	"nдата",
	"122"	:	"примечания",		
	"143"	:	"nперенос"
	}
	},
	"B39": { 
	"name"	:	"взаимные расчеты", 
	"prop"	:	{
	"12"	:	"вид билета",
	"19"	:	"автор",
	"21"	:	"номер билета",
	"22"	:	"номер рейса",
	"28"	:	"время отправления",
	"36"	:	"дата",
	"37"	:	"номер ведомости",
	"70"	:	"поля билета",
	"101"	:	"владелец",
	"107"	:	"внешний номер",
	"108"	:	"поля сдн",
	"109"	:	"код АС",
	"110"	:	"код АТП",
	"120"	:	"маршрут",
	"121"	:	"nдата",
	"134"	:	"аналитика",		
	"143"	:	"nперенос"
	}
	},
	"B40": { 
	"name"	:	"внешние операции", 
	"prop"	:	{
	"9"		:	"код организации от",
	"10"	:	"код организации до",
	"12"	:	"вид билета",
	"21"	:	"номер билета",
	"22"	:	"номер рейса",
	"36"	:	"дата",
	"37"	:	"номер ведомости",
	"70"	:	"поля билета",
	"101"	:	"владелец",
	"107"	:	"внешний номер",
	"108"	:	"поля сдн",
	"109"	:	"код АС",
	"121"	:	"nдата",
	"134"	:	"аналитика",
	"139"	:	"дата операции",
	"140"	:	"nдата операции",		
	"143"	:	"nперенос"
	}
	},
	"B41": { 
	"name"	:	"операции гостей", 
	"prop"	:	{
	"9"		:	"код организации от",
	"10"	:	"код организации до",
	"12"	:	"вид билета",
	"21"	:	"номер билета",
	"22"	:	"номер рейса",
	"36"	:	"дата",
	"37"	:	"номер ведомости",
	"70"	:	"поля билета",
	"101"	:	"владелец",
	"107"	:	"внешний номер",
	"108"	:	"поля сдн",
	"109"	:	"код АС",
	"121"	:	"nдата",
	"134"	:	"аналитика",
	"139"	:	"дата операции",
	"140"	:	"nдата операции",		
	"143"	:	"nперенос"
	}
	},
	"B42": { 
	"name"	:	"карточки АТП", 
	"prop"	:	{
	"19"	:	"автор",
	"101"	:	"владелец",
	"107"	:	"внешний номер",
	"109"	:	"код АС",
	"110"	:	"код АТП",
	"128"	:	"дебет",
	"129"	:	"кредит",
	"130"	:	"дата с",
	"131"	:	"дата по",
	"132"	:	"nдата с",
	"133"	:	"nдата по",
	"134"	:	"аналитика",
	"137"	:	"операция",		
	"143"	:	"nперенос"
	}
	},
	"B43": { 
	"name"	:	"платежи", 
	"prop"	:	{
	"19"	:	"автор",
	"34"	:	"наименование организации",
	"35"	:	"атрибуты организации",
	"36"	:	"дата",
	"107"	:	"внешний номер",
	"110"	:	"код АТП",
	"121"	:	"nдата",
	"128"	:	"дебет",
	"134"	:	"аналитика",
	"135"	:	"р/счет",
	"136"	:	"МФО",
	"137"	:	"операция",		
	"143"	:	"nперенос"
	}
	},
	"B44": { 
	"name"	:	"препровод", 
	"prop"	:	{
	"19"	:	"автор",
	"34"	:	"наименование организации",
	"36"	:	"дата",
	"107"	:	"внешний номер",
	"109"	:	"код АС",
	"110"	:	"код АТП",
	"121"	:	"nдата",
	"129"	:	"кредит",
	"134"	:	"аналитика",
	"135"	:	"р/счет",
	"136"	:	"МФО",
	"137"	:	"операция",		
	"143"	:	"nперенос"
	}
	},
	"B45": { 
	"name"	:	"выписки", 
	"prop"	:	{
	"19"	:	"автор",
	"26"	:	"код организации",
	"107"	:	"внешний номер",
	"128"	:	"дебет",
	"130"	:	"дата с",
	"131"	:	"дата по",
	"132"	:	"nдата с",
	"133"	:	"nдата по",
	"134"	:	"аналитика",
	"135"	:	"р/счет",
	"136"	:	"МФО",
	"137"	:	"операция",		
	"143"	:	"nперенос"
	}
	},
	"B46": { 
	"name"	:	"файлы", 
	"prop"	:	{
	"19"	:	"автор",
	"107"	:	"внешний номер",
	"109"	:	"код АС",
	"110"	:	"код АТП",
	"130"	:	"дата с",
	"131"	:	"дата по",
	"132"	:	"nдата с",
	"133"	:	"nдата по",
	"137"	:	"операция",		
	"138"	:	"имя файла"
	}
	},
	"B47": { 
	"name"	:	"", 
	"prop"	:	{
	"19"	:	"автор",
	"43"	:	"табельный номер",
	"109"	:	"код АС",
	"130"	:	"дата с",
	"131"	:	"дата по",
	"132"	:	"nдата с",
	"133"	:	"nдата по",
	"134"	:	"аналитика",	
	"137"	:	"операция"
	}
	},
	"B48": { 
	"name"	:	"флаги", 
	"prop"	:	{
	"19"	:	"автор",
	"20"	:	"значение",
	"36"	:	"дата",
	"122"	:	"примечания",
	"141"	:	"группа флагов",
	"142"	:	"имя флага"
	}
	},
	"B49": { 
	"name"	:	"услуги", 
	"prop"	:	{
	"19"	:	"автор",
	"36"	:	"дата",
	"43"	:	"табельный номер",
	"80"	:	"код документа",
	"81"	:	"название документа",
	"101"	:	"владелец",
	"107"	:	"внешний номер",
	"109"	:	"код АС",
	"121"	:	"nдата",
	"122"	:	"примечания",
	"134"	:	"аналитика",		
	"143"	:	"nперенос"
	}
	},
	"B50": { 
	"name"	:	"переходящие операции", 
	"prop"	:	{
	"9"		:	"код организации от",
	"10"	:	"код организации до",
	"12"	:	"вид билета",
	"19"	:	"автор",
	"21"	:	"номер билета",
	"22"	:	"номер рейса",
	"24"	:	"тип рейса",
	"36"	:	"дата",
	"37"	:	"номер ведомости",
	"70"	:	"поля билета",
	"101"	:	"владелец",
	"107"	:	"внешний номер",
	"108"	:	"поля сдн",
	"109"	:	"код АС",
	"121"	:	"nдата",
	"122"	:	"примечания",
	"134"	:	"аналитика",
	"139"	:	"дата операции",
	"140"	:	"nдата операции",		
	"143"	:	"nперенос"
	}
	},
	"B51": { 
	"name"	:	"особые билеты", 
	"prop"	:	{
	"9"		:	"код организации от",
	"10"	:	"код организации до",
	"12"	:	"вид билета",
	"19"	:	"автор",
	"21"	:	"номер билета",
	"22"	:	"номер рейса",
	"24"	:	"тип рейса",
	"28"	:	"время отправления",
	"36"	:	"дата",
	"37"	:	"номер ведомости",
	"40"	:	"стоимость",
	"70"	:	"поля билета",
	"80"	:	"код документа",
	"101"	:	"владелец",
	"107"	:	"внешний номер",
	"108"	:	"поля сдн",
	"109"	:	"код АС",
	"120"	:	"маршрут",
	"121"	:	"nдата",
	"122"	:	"примечания",
	"134"	:	"аналитика",
	"139"	:	"дата операции",
	"140"	:	"nдата операции",		
	"143"	:	"nперенос"
	}
	},
	"B53": { 
	"name"	:	"сданные билеты", 
	"prop"	:	{
	"9"		:	"код организации от",
	"10"	:	"код организации до",
	"12"	:	"вид билета",
	"19"	:	"автор",
	"21"	:	"номер билета",
	"22"	:	"номер рейса",
	"24"	:	"тип рейса",
	"28"	:	"тип рейса",
	"36"	:	"дата",
	"37"	:	"номер ведомости",
	"69"	:	"статус ведомости",
	"70"	:	"поля билета",
	"101"	:	"владелец",
	"107"	:	"внешний номер",
	"108"	:	"поля сдн",
	"109"	:	"код АС",
	"110"	:	"код АТП",
	"120"	:	"маршрут",
	"121"	:	"nдата",
	"122"	:	"примечания",
	"134"	:	"аналитика",
	"139"	:	"дата операции",
	"140"	:	"nдата операции",		
	"143"	:	"nперенос"
	}
	},
	"B54": { 
	"name"	:	"ваучеры", 
	"prop"	:	{
	"9"		:	"код организации от",
	"10"	:	"код организации до",
	"12"	:	"вид билета",
	"19"	:	"автор",
	"21"	:	"номер билета",
	"22"	:	"номер рейса",
	"36"	:	"дата",
	"37"	:	"номер ведомости",
	"70"	:	"поля билета",
	"86"	:	"номер документа",
	"101"	:	"владелец",
	"107"	:	"внешний номер",
	"109"	:	"код АС",
	"121"	:	"nдата",
	"134"	:	"аналитика",
	"139"	:	"дата операции",
	"140"	:	"nдата операции",		
	"143"	:	"nперенос"
	}
	}

}
if __name__ == '__main__':
	pass